app/views/notes/_note.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 4]]
---

<% track.notes.each do |note| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    <%= h(note.content) %>
    - <%= h(note.user.email[0..30]) %><%= note.user.email.length >= 30 ? "..." : "" %>