app/views/tracks/_form.html.erb

<% button_val = (track.persisted? ? "Update Track" : "Create Track") %>
<% this_album = (track.persisted? ? track.album : Album.find(params[:album_id])) %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      <option>-- Choose One --</option>
      <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"