app/views/tracks/new.html.erb


<% this_album = Album.find(params[:album_id]) %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]