app/views/albums/_form.html.erb

<% button_val = (album.persisted? ? "Update Album" : "Create Album" ) %>
<% this_band = (album.persisted? ? album.band : Band.find(params[:band_id]) )%>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

        <option>-- Choose One --</option>
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"