app/views/albums/new.html.erb


<% this_band = Band.find(params[:band_id]) %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]