app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]
---
   <ul class="display-list">
     <% current_album.tracks.each do |track| %>

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    <% end %>
    <a class="button" href="<%= band_url(current_album.band) %>">Back to: <%= h(current_album.band.name[0..40]) %><%= current_album.band.name.length >=40 ? "..." : "" %></a>