app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 10]]
---
  <ul class="display-list">
    <% current_band.albums.each do |album| %>