app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 3], ["title", "Skeedle Bop"], ["year", 2005], ["live", true], ["created_at", "2020-05-05 02:07:46.081888"], ["updated_at", "2020-05-05 02:07:46.081888"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 2007], ["updated_at", "2020-05-05 18:09:47.235756"], ["id", 10]]
---
  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
---
  def destroy
    @album = Album.find(params[:id])
    band = @album.band
    if @album.destroy!