app/controllers/application_controller.rb

  def current_band
    return nil unless params[:id]
    @current_band ||= Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def current_album
    return nil unless params[:id]
    @current_album ||= Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def current_track
    return nil unless params[:id]
    @current_track ||= Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]