app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 11], ["track_id", 4], ["content", "YEEEEHAAA"], ["created_at", "2020-05-06 21:03:39.247271"], ["updated_at", "2020-05-06 21:03:39.247271"]]
---
  def create
    @note = Note.new(note_params)

    @note.user_id = current_user.id
    @note.track_id = params[:note][:track]

    if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
  def destroy
    @note = Note.find(params[:id])


    if @note && current_user.id == @note.user_id

      if @note.destroy