app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("name", "album_id", "ord", "bonus", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Wee-Bop"], ["album_id", 3], ["ord", 1], ["bonus", true], ["lyrics", "HAHAHAHA"], ["created_at", "2020-05-05 22:49:32.776935"], ["updated_at", "2020-05-05 22:49:32.776935"]]
---
  def create
    @track = Track.new(tracks_params)

    if @track.valid?
      if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tracks" SET "name" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["name", "<script>alert(console)</script>"], ["lyrics", ""], ["updated_at", "2020-05-06 22:18:31.141857"], ["id", 9]]
---
  def update
    @track = Track.find(params[:id])

    if @track.update(tracks_params)