app/controllers/users_controller.rb

  def admin
    @user = User.find(params[:id])
    @user.toggle(:admin)
    @user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", true], ["updated_at", "2020-05-08 02:07:45.477876"], ["id", 39]]

  def activate

    @user = User.find_by(activation_token: params[:activation_token])

    if @user
      @user.toggle(:activated)
      @user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "SQ-ymf1FzSf4jcneQ18eeA"], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "EFifrl6k34MFGJsvNUc49Q"], ["updated_at", "2020-05-07 23:18:04.174409"], ["id", 48]]
UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", true], ["updated_at", "2020-05-08 02:06:54.858528"], ["id", 49]]

  def create

    @user = User.new(user_params)
    @user.activation_token = User.generate_activation_token
    @user.admin = false
    @user.activated = false

    if User.email_taken?(@user.email)
      flash[:errors] = ["Email taken, sign in, or try another."]
      redirect_to new_user_url

    elsif !User.pass_valid?(params[:user][:password])
      flash[:errors] = ["Invalid password, please try another - (Must be at least 6 characters)"]
      redirect_to new_user_url
    elsif @user.save!
---
INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at", "activation_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"