app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@admin.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    # Note: Pass up nil from here, handle error msg setting in cont
    @user = User.find_by(email: email)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Kop@admin.com"], ["LIMIT", 1]]
---
  def self.email_taken?(email)
    @user = User.find_by(email: email)